Task
----------
### Design and create a database for scraping All books for each category using DB Browser for sqllite from this web site (http://books.toscrape.com/) ###

01) Write a sql query to get books that has rate >=3 and has 'Mr' in its name.

02) Write a sql query to get books that has rate >=3 or price > 20.

03) Write a sql query to get books that has rate not 3.

04) Write a sql query to get books that has price between 10 and 40 and has rate 3 or 4 or 1.

05) Write a sql query to get the top 5 most expensive books (order books desc with price column and then limit the result to the first 5).

06) Write a sql query to get the 3rd 10 books in the books table order first by rate desc and then by price asc.

07) Write a sql query to add a new category in categories table and add 5 books to this category in books table with title, rate and price.

08) Write a sql query to update book's rate to 3 that thier price < 20£.

09) Write a sql query to delete all books that have price > 50£ and has rate <= 2.

10) Write a sql query to count the number of books that have 'Secret' in thier names and price between 10£ and 25£.

11) Write a sql query to get the minimum & maximum price for all the books that have rate 5.

12) Write a sql query to calculate the avg price for all the books that have rate 5.

13) Write a sql query to sum all book's price that have rate 2 and price between 10 and 40.

14) Write a sql query to join both books & categories table into one new table containing book_name & category_name & book_rate and book_price.

15) Write a sql query to calculate how many books each rate has and have price between 20£ and 30£.

16) Write a sql query to calculate how many books each category has having count > 10.

17) Write a sql query to get all books with category_name='Music' using subquery.

In [ ]:
#refresh
connection.close()

In [ ]:
#refresh
connection = sqlite3.connect('edited database\Books to scrape.db')

### ==== Code ==== ###

In [20]:
import sqlite3
connection = sqlite3.connect('edited database\Books to scrape.db')

In [2]:
#01) Write a sql query to get books that has rate >=3 and has 'Mr' in its name.
sql = "SELECT * FROM Books WHERE Book_Rating >= 3 AND Book_Name LIKE '%Mr%'"
cursor = connection.execute(sql)
cursor.fetchmany(10)

[(1049, 'Mrs. Houdini', 30.25, 5, 3051),
 (1244, 'My Mrs. Brown', 24.48, 3, 3086),
 (1249, 'Dear Mr. Knightley', 11.21, 5, 3086)]

In [3]:
#02) Write a sql query to get books that has rate >=3 or price > 20.
sql = "SELECT Book_Name, Book_Rating, Book_Price FROM Books WHERE Book_Rating >= 3 OR Book_Price > 20 "
cursor = connection.execute(sql)
cursor.fetchmany(10)

[("It's Only the Himalayas", 2, 45.17),
 ('Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond',
  4,
  49.43),
 ('See America: A Celebration of Our National Parks & Treasured Sites',
  3,
  48.87),
 ('Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel',
  2,
  36.94),
 ('Under the Tuscan Sun', 3, 37.33),
 ('A Summer In Europe', 2, 44.34),
 ('The Great Railway Bazaar', 1, 30.54),
 ('A Year in Provence (Provence #1)', 4, 56.88),
 ('The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)',
  1,
  23.21),
 ('Neither Here nor There: Travels in Europe', 3, 38.95)]

In [4]:
#03) Write a sql query to get books that has rate not 3.
sql = "SELECT Book_Name, Book_Rating FROM Books WHERE NOT Book_Rating = 3"
cursor = connection.execute(sql)
cursor.fetchmany(10)

[("It's Only the Himalayas", 2),
 ('Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond', 4),
 ('Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel', 2),
 ('A Summer In Europe', 2),
 ('The Great Railway Bazaar', 1),
 ('A Year in Provence (Provence #1)', 4),
 ('The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)',
  1),
 ('1,000 Places to See Before You Die', 5),
 ('Sharp Objects', 4),
 ('In a Dark, Dark Wood', 1)]

In [5]:
#04) Write a sql query to get books that has price between 10 and 40 and has rate 3 or 4 or 1.
sql = "SELECT Book_Name, Book_Price, Book_Rating FROM Books WHERE (Book_Price > 10 AND Book_Price < 40) AND Book_Rating IN (1,3,4)"
cursor = connection.execute(sql)
cursor.fetchmany(10)

[('Under the Tuscan Sun', 37.33, 3),
 ('The Great Railway Bazaar', 30.54, 1),
 ('The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)',
  23.21,
  1),
 ('Neither Here nor There: Travels in Europe', 38.95, 3),
 ('In a Dark, Dark Wood', 19.63, 1),
 ('A Murder in Time', 16.64, 1),
 ('That Darkness (Gardiner and Renner #1)', 13.92, 1),
 ('Tastes Like Fear (DI Marnie Rome #3)', 10.69, 1),
 ('Poisonous (Max Revere Novels #3)', 26.8, 3),
 ('Most Wanted', 35.28, 3)]

In [6]:
#05) Write a sql query to get the top 5 most expensive books 
#(order books desc with price column and then limit the result to the first 5).
sql = "SELECT Book_Name, Book_Price FROM Books ORDER BY Book_Price DESC"
cursor = connection.execute(sql)
cursor.fetchmany(5)

[('The Perfect Play (Play by Play #1)', 59.99),
 ('Last One Home (New Beginnings #1)', 59.98),
 ('Civilization and Its Discontents', 59.95),
 ('The Barefoot Contessa Cookbook', 59.92),
 ('The Diary of a Young Girl', 59.9)]

In [7]:
#06) Write a sql query to get the 3rd 10 books in the books table 
#order first by rate desc and then by price asc.

sql = "SELECT * FROM (SELECT Book_Name, Book_Rating, Book_Price From Books ORDER BY Book_Rating DESC, Book_Price ASC) LIMIT 20,10"

# "SELECT * FROM (
#     SELECT Book_Name, Book_Rating, Book_Price 
#     From Books ORDER BY Book_Rating DESC, Book_Price ASC
#  )LIMIT 20,10"

cursor = connection.execute(sql)
#cursor.fetchmany(10)
cursor.fetchall()

[('The Epidemic (The Program 0.6)', 5, 14.44),
 ("A Gentleman's Position (Society of Gentlemen #3)", 5, 14.75),
 ('Hyperbole and a Half: Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happened',
  5,
  14.75),
 ('Disrupted: My Misadventure in the Start-Up Bubble', 5, 15.28),
 ('Fifty Shades Freed (Fifty Shades #3)', 5, 15.36),
 ('Batman: The Dark Knight Returns (Batman)', 5, 15.38),
 ('The Collected Poems of W.B. Yeats (The Collected Works of W.B. Yeats #1)',
  5,
  15.42),
 ('Kill the Boy Band', 5, 15.52),
 ("Sophie's World", 5, 15.94),
 ('Shiver (The Wolves of Mercy Falls #1)', 5, 16.23)]

In [21]:
#07) Write a sql query to add a new category in categories table
# and add 5 books to this category in books table with title, rate and price.

sql = "INSERT INTO Categories (Cat_Name) VALUES (?)"
data = ['New']
cursor = connection.execute(sql,data)
connection.commit()

In [22]:
sql = "SELECT * FROM Categories WHERE Cat_Name = ?"
#data = ['New']
cursor = connection.execute(sql,data)
cursor.fetchall()

[(3105, 'New')]

In [23]:
sql = "INSERT INTO Books (Book_Name,Book_Rating,Book_Price,Cat_ID) VALUES ('The Childern of Tomorrow',3,10,3105),('2938: Prophecy',4,23,3105),('Ascendent Exile',3,11,3105),('Halcyon Frontier',4,20,3105),('Last Instinct',4,18,3105)"

# "INSERT INTO Books (Book_Name,Book_Rating,Book_Price,Cat_ID) VALUES 
#     ('The Childern of Tomorrow',3,10,3105),
#     ('2938: Prophecy',4,23,3105),
#     ('Ascendent Exile',3,11,3105),
#     ('Halcyon Frontier',4,20,3105),
#     ('Last Instinct',4,18,3105)"

cursor = connection.execute(sql)
connection.commit()

In [24]:
sql = "SELECT Book_Name, Book_Rating, Book_Price FROM Books WHERE Cat_ID = 3105"
cursor.execute(sql)
cursor.fetchall()

[('The Childern of Tomorrow', 3, 10),
 ('2938: Prophecy', 4, 23),
 ('Ascendent Exile', 3, 11),
 ('Halcyon Frontier', 4, 20),
 ('Last Instinct', 4, 18)]

In [25]:
#08) Write a sql query to update book's rate to 3 that thier price < 20£.
sql = "UPDATE Books SET Book_Rating = 3 WHERE Book_Price < 20"
cursor = connection.execute(sql)
connection.commit()

In [26]:
sql = "SELECT Book_Name, Book_Rating, Book_Price FROM Books WHERE Book_Price < 20"
cursor.execute(sql)
cursor.fetchmany(10)

[('In a Dark, Dark Wood', 3, 19.63),
 ('A Murder in Time', 3, 16.64),
 ('That Darkness (Gardiner and Renner #1)', 3, 13.92),
 ('Tastes Like Fear (DI Marnie Rome #3)', 3, 10.69),
 ('A Study in Scarlet (Sherlock Holmes #1)', 3, 16.73),
 ('Hide Away (Eve Duncan #20)', 3, 11.84),
 ('Playing with Fire', 3, 13.71),
 ("The Cuckoo's Calling (Cormoran Strike #1)", 3, 19.21),
 ('The Girl You Lost', 3, 12.29),
 ('The Girl In The Ice (DCI Erika Foster #1)', 3, 15.85)]

In [27]:
#09) Write a sql query to delete all books that have price > 50£ and has rate <= 2.
sql = "DELETE FROM Books WHERE Book_Price > 50 AND Book_Rating <= 2"
cursor = connection.execute(sql)
connection.commit()

In [29]:
sql = "SELECT * FROM Books WHERE Book_Price > 50 AND Book_Rating <= 2"
cursor.execute(sql)
cursor.fetchall()

[]

In [33]:
#10) Write a sql query to count the number of books that have 'Secret' in thier names 
#and price between 10£ and 25£.
sql = "SELECT COUNT(Book_Name) FROM Books WHERE Book_Name LIKE '%Secret%' AND Book_Price > 10 AND Book_Price < 25"
cursor.execute(sql)
cursor.fetchone()

(5,)

In [35]:
#11) Write a sql query to get the minimum & maximum price for all the books that have rate 5.
sql = "SELECT MIN(Book_Price), MAX(Book_Price) FROM Books WHERE Book_Rating = 5"
cursor.execute(sql)
cursor.fetchone()

(20.02, 59.92)

In [36]:
#12) Write a sql query to calculate the avg price for all the books that have rate 5.
sql = "SELECT AVG(Book_Price) FROM Books WHERE Book_Rating = 5"
cursor.execute(sql)
cursor.fetchone()

(41.05000000000002,)

In [37]:
#13) Write a sql query to sum all book's price that have rate 2 and price between 10 and 40.
sql = "SELECT SUM(Book_Price) FROM Books WHERE Book_Rating = 2 AND Book_Price > 10 AND Book_Price < 40"
cursor.execute(sql)
cursor.fetchone()

(2772.749999999999,)

In [40]:
#14) Write a sql query to join both books & categories table into one new table 
#containing book_name & category_name & book_rate and book_price.
sql = "SELECT Categories.Cat_Name, Books.Book_Name, Books.Book_Rating, Books.Book_Price From Books INNER JOIN Categories On Books.Cat_ID = Categories.Cat_ID"

# "SELECT Books.Book_Name, Books.Book_Rating, Books.Book_Price, Categories.Cat_Name From
# Books INNER JOIN Categories On Books.Cat_ID = Categories.Cat_ID"

cursor.execute(sql)
cursor.fetchmany(10)

[('Travel', "It's Only the Himalayas", 2, 45.17),
 ('Travel',
  'Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond',
  4,
  49.43),
 ('Travel',
  'See America: A Celebration of Our National Parks & Treasured Sites',
  3,
  48.87),
 ('Travel',
  'Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel',
  2,
  36.94),
 ('Travel', 'Under the Tuscan Sun', 3, 37.33),
 ('Travel', 'A Summer In Europe', 2, 44.34),
 ('Travel', 'The Great Railway Bazaar', 1, 30.54),
 ('Travel', 'A Year in Provence (Provence #1)', 4, 56.88),
 ('Travel',
  'The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)',
  1,
  23.21),
 ('Travel', 'Neither Here nor There: Travels in Europe', 3, 38.95)]

In [44]:
#15) Write a sql query to calculate how many books each rate has and have price between 20£ and 30£.
sql = "SELECT COUNT(Book_Name), Book_Rating FROM Books WHERE Book_Price > 20 AND Book_Price < 30 GROUP BY Book_Rating"

# "SELECT COUNT(Book_Name), Book_Rating FROM Books WHERE 
# Book_Price > 20 AND Book_Price < 30 GROUP BY Book_Rating"

cursor.execute(sql)
cursor.fetchall()

[(55, 1), (40, 2), (41, 3), (35, 4), (36, 5)]

In [48]:
#    55 + 40 + 41 + 35 + 36 = 207 
sql = "SELECT COUNT(Book_Name) FROM Books WHERE Book_Price > 20 AND Book_Price < 30 "
cursor.execute(sql)
cursor.fetchone()

(207,)

In [56]:
#16) Write a sql query to calculate how many books each category has having count > 10.
sql = "SELECT Categories.Cat_Name, Book_Count FROM Categories INNER JOIN (SELECT * FROM (SELECT Cat_ID AS Categ_ID, COUNT(Book_Name) AS Book_Count FROM Books GROUP BY Cat_ID) WHERE Book_Count > 10) ON Categories.Cat_ID = Categ_ID"

# "SELECT Categories.Cat_Name, Book_Count FROM Categories INNER JOIN 
#     (SELECT * FROM 
#         (SELECT Cat_ID AS Categ_ID, COUNT(Book_Name) AS Book_Count 
#         FROM Books GROUP BY Cat_ID) 
#     WHERE Book_Count > 10) 
# ON Categories.Cat_ID = Categ_ID"

cursor.execute(sql)
cursor.fetchall()

[('Historical Fiction', 24),
 ('Romance', 33),
 ('Science', 13),
 ('Sequential Art', 70),
 ('Music', 11),
 ('Womens Fiction', 16),
 ('Horror', 15),
 ('Nonfiction', 104),
 ('Fantasy', 40),
 ('Classics', 17),
 ('Business', 11),
 ('Mystery', 30),
 ('Add a comment', 60),
 ('Travel', 11),
 ('Thriller', 11),
 ('Fiction', 60),
 ('Young Adult', 50),
 ('Poetry', 18),
 ('History', 16),
 ('Childrens', 28),
 ('Default', 144),
 ('Science Fiction', 14),
 ('Food and Drink', 28)]

In [60]:
#17) Write a sql query to get all books with category_name='Music' using subquery.
sql = "SELECT Books.Book_Name FROM Books INNER JOIN (SELECT Cat_ID AS Categ_ID FROM Categories WHERE Cat_Name = 'Music') ON Categ_ID = Books.Cat_ID"

# "SELECT Books.Book_Name FROM Books INNER JOIN 
#     (SELECT Cat_ID AS Categ_ID FROM Categories WHERE Cat_Name = 'Music')
# ON Categ_ID = Books.Cat_ID"

cursor.execute(sql)
cursor.fetchall()

[('Rip it Up and Start Again',),
 ('Our Band Could Be Your Life: Scenes from the American Indie Underground, 1981-1991',),
 ('How Music Works',),
 ('Love Is a Mix Tape (Music #1)',),
 ('Please Kill Me: The Uncensored Oral History of Punk',),
 ("Kill 'Em and Leave: Searching for James Brown and the American Soul",),
 ('This Is Your Brain on Music: The Science of a Human Obsession',),
 ('Orchestra of Exiles: The Story of Bronislaw Huberman, the Israel Philharmonic, and the One Thousand Jews He Saved from Nazi Horrors',),
 ('No One Here Gets Out Alive',),
 ('Life',),
 ('Forever Rockers (The Rocker #12)',)]